package com.example.stydyrussian.testData


val testQuestions1 = listOf(
    Question(
        "1.\tКакое из следующих слов написано верно согласно правилам образования причастий?",
        listOf(
            Answer("а) планирующий", false),
            Answer("б) планирувшый", true),
            Answer("в) планировавший", false)
        )
    ),
    Question(
        "2.\tКакое причастие написано правильно?",
        listOf(
            Answer("а) спотыкающийся", false),
            Answer("б) спотыкавшийся", true),
            Answer("в) спотыкающийсь", false)
        )
    ),
    Question(
        "3.\tКакое слово написано верно? ",
        listOf(
            Answer("а) пришедший ", false),
            Answer("б) приходивший", true),
            Answer("в) пришедевший", false)
        )
    ),
    Question(
        "4.\tКакое причастие написано правильно? ",
        listOf(
            Answer("а) умирающий", false),
            Answer("б) умирравший ", true),
            Answer("в) умиравший", false)
        )
    ),
    Question(
        "5.\tКакое слово написано правильно?",
        listOf(
            Answer("а) погружающий", false),
            Answer("б) погружавшийся ", true),
            Answer("в) погружающийся", false)
        )
    ),
    Question(
        "6.\tКакое причастие написано правильно?",
        listOf(
            Answer("а) проигрывающий ", false),
            Answer("б) проигравший ", true),
            Answer("в) проигрывавший", false)
        )
    ),
    Question(
        "7.\tКакое слово написано верно?",
        listOf(
            Answer("а) уезжавший", false),
            Answer("б) уезжающийся", true),
            Answer("в) уезжающий", false)
        )
    ),
    Question(
        "8.\tКакое причастие написано правильно?",
        listOf(
            Answer("а) ожидающий", false),
            Answer("б) ожидалший", true),
            Answer("в) ожидавший", false)
        )
    ),
    Question(
        "9.\tКакое слово написано верно?",
        listOf(
            Answer("а) обучивший", false),
            Answer("б) обучающийся ", true),
            Answer("в) обучавшийся", false)
        )
    ),
    Question(
        "10.\tКакое причастие написано правильно?",
        listOf(
            Answer("а) кричающий", false),
            Answer("б) кричавшийся", true),
            Answer("в) кричавший", false)
        )
    ),
)

val testQuestions2 = listOf(
    Question(
        "1. Совершенные глаголы обозначают действие, которое рассматривается в:",
        listOf(
            Answer("а) прошлом или будущем.", false),
            Answer("б) настоящем времени.", false),
            Answer("в) процессе развития.", true)
        )
    ),

    Question(
        "2. Какие глаголы используются для описания действий в процессе развития или неопределенности по отношению к завершенности?",
        listOf(
            Answer("а) Совершенные.", false),
            Answer("б) Несовершенные.", true),
            Answer("в) Оба типа глаголов.", false)
        )
    ),

    Question(
        "3. Какие приставки могут использоваться для образования формы прошедшего времени совершенных глаголов?",
        listOf(
            Answer("а) 'по-' или 'с-'.", true),
            Answer("б) 'бы-' или 'ст-'.", false),
            Answer("в) 'не-' или 'раз-'.", false)
        )
    ),

    Question(
        "4. Какие глаголы могут образовывать будущее время с помощью вспомогательного глагола 'быть' и инфинитива с неопределенной формой?",
        listOf(
            Answer("а) Совершенные.", false),
            Answer("б) Несовершенные.", true),
            Answer("в) Оба типа глаголов.", false)
        )
    ),

    Question(
        "5. Какие глаголы чаще используются для выражения результативного действия?",
        listOf(
            Answer("а) Совершенные.", true),
            Answer("б) Несовершенные.", false),
            Answer("в) Оба типа глаголов.", false)
        )
    ),

    Question(
        "6. В каких случаях глаголы могут использоваться в зависимости от контекста, чтобы передать значение действия и его характеристики?",
        listOf(
            Answer("а) Только совершенные.", false),
            Answer("б) Только несовершенные.", false),
            Answer("в) Оба типа глаголов.", true)
        )
    ),

    Question(
        "7. Какие глаголы указывают на завершенные действия без уточнения продолжительности или регулярности?",
        listOf(
            Answer("а) Совершенные.", true),
            Answer("б) Несовершенные.", false),
            Answer("в) Оба типа глаголов.", false)
        )
    ),

    Question(
        "8. Какие глаголы описывают действия, происходящие в настоящем времени или регулярно повторяющиеся?",
        listOf(
            Answer("а) Совершенные.", false),
            Answer("б) Несовершенные.", true),
            Answer("в) Оба типа глаголов.", false)
        )
    ),

    Question(
        "9. В чем различие между совершенными и несовершенными глаголами?",
        listOf(
            Answer("а) Совершенные - процесс, а несовершенные - завершенные действия.", false),
            Answer("б) Совершенные - законченное действие, несовершенные - процесс.", true),
            Answer("в) Несовершенные выражают будущее время, совершенные - прошедшее.", false)
        )
    ),

    Question(
        "10. Какие глаголы чаще используются для описания регулярно повторяющихся действий?",
        listOf(
            Answer("а) Совершенные.", false),
            Answer("б) Несовершенные.", true),
            Answer("в) Оба типа глаголов.", false)
        )
    )
)

val testQuestions3 = listOf(
    Question(
        "1. Какая частица используется для выражения отрицания нескольких вариантов или альтернатив?",
        listOf(
            Answer("а) Нет", false),
            Answer("б) Не", false),
            Answer("в) Ни", true)
        )
    ),

    Question(
        "2. В каком случае 'не' может употребляться в сочетании с предлогами?",
        listOf(
            Answer("а) В начале предложения", false),
            Answer("б) В образовании сложных слов", true),
            Answer("в) В конце предложения", false)
        )
    ),

    Question(
        "3. Какая из нижеприведенных фраз использует 'ни' для подчеркивания абсолютной неправдоподобности?",
        listOf(
            Answer("а) Я не могу согласиться с этим", false),
            Answer("б) Ни разу не видел такого!", true),
            Answer("в) Не верю тебе", false)
        )
    ),

    Question(
        "4. Какая частица употребляется в предложении 'Он ___ разу не приходил на занятия'?",
        listOf(
            Answer("а) Не", true),
            Answer("б) Ни", false),
            Answer("в) Нет", false)
        )
    ),

    Question(
        "5. Как обычно пишется 'не' относительно глагола или другого слова, к которому она относится?",
        listOf(
            Answer("а) Вместе с другими словами", false),
            Answer("б) Отдельно", true),
            Answer("в) Слитно", false)
        )
    ),

    Question(
        "6. Какая из нижеприведенных пар употребляется в сочетании с другими словами или выражениями?",
        listOf(
            Answer("а) Не", false),
            Answer("б) Ни", true),
            Answer("в) Оба варианта", false)
        )
    ),

    Question(
        "7. Какая частица используется в предложении 'Я ___ хочу делать это'?",
        listOf(
            Answer("а) Не", true),
            Answer("б) Ни", false),
            Answer("в) Нет", false)
        )
    ),

    Question(
        "8. В каком случае 'ни' обычно употребляется?",
        listOf(
            Answer("а) В начале предложения", false),
            Answer("б) В сочетании с предлогами", false),
            Answer("в) С другими словами для выражения отрицания нескольких вариантов", true)
        )
    ),

    Question(
        "9. Как обычно пишется 'не' относительно глагола или другого слова, к которому она относится?",
        listOf(
            Answer("а) Вместе с другими словами", false),
            Answer("б) Отдельно", true),
            Answer("в) Слитно", false)
        )
    ),

    Question(
        "10. В каком случае 'ни' может использоваться для подчеркивания утверждения и обозначения его абсолютной неправдоподобности?",
        listOf(
            Answer("а) В середине предложения", false),
            Answer("б) В начале предложения", true),
            Answer("в) В конце предложения", false)
        )
    )
)

val testQuestions4 = listOf(
    Question(
        "1. Что такое прямая речь?",
        listOf(
            Answer(
                "а) Буквальное воспроизведение высказывания человека, заключенное в кавычки.",
                true
            ),
            Answer("б) Передача высказывания человека с изменениями времени глагола.", false),
            Answer(
                "в) Передача высказывания человека с указанием на авторство высказывания.",
                false
            )
        )
    ),

    Question(
        "2. Как называется форма передачи высказывания другого человека с изменением формы и времени глагола?",
        listOf(
            Answer("а) Прямая речь.", false),
            Answer("б) Косвенная речь.", true),
            Answer("в) Пассивная речь.", false)
        )
    ),

    Question(
        "3. В каком случае частица 'не' используется для отрицания нескольких вариантов или альтернатив?",
        listOf(
            Answer("а) В прямой речи.", false),
            Answer("б) В косвенной речи.", true),
            Answer("в) В обоих случаях.", false)
        )
    ),

    Question(
        "4. Что обычно начинает косвенную речь?",
        listOf(
            Answer("а) Выражение 'сказал(а), что'.", true),
            Answer("б) Выражение 'сказал(а)'.", false),
            Answer("в) Выражение 'по его словам'.", false)
        )
    ),

    Question(
        "5. Что может изменяться в косвенной речи помимо времени и формы глаголов?",
        listOf(
            Answer("а) Местоимения.", true),
            Answer("б) Спряжение существительных.", false),
            Answer("в) Цветовые характеристики.", false)
        )
    ),

    Question(
        "6. В каком случае используется выражение 'по его словам'?",
        listOf(
            Answer("а) В прямой речи.", false),
            Answer("б) В косвенной речи.", true),
            Answer("в) В обоих случаях.", false)
        )
    ),

    Question(
        "7. Какая частица обычно используется для указания на отрицание в прямой речи?",
        listOf(
            Answer("а) Не.", true),
            Answer("б) Ни.", false),
            Answer("в) Нет.", false)
        )
    ),

    Question(
        "8. Какие изменения происходят с глаголами в косвенной речи?",
        listOf(
            Answer("а) Они остаются без изменений.", false),
            Answer(
                "б) Они переносятся в прошедшее время и изменяются с учетом лица и числа.",
                true
            ),
            Answer("в) Они переносятся в будущее время.", false)
        )
    ),

    Question(
        "9. Какое предложение является примером прямой речи?",
        listOf(
            Answer("а) 'Он сказал, что уходит'.", false),
            Answer("б) 'Он сказал: «Я ухожу»'.", true),
            Answer("в) 'Он сказал, что ушел'.", false)
        )
    ),

    Question(
        "10. Что важно учитывать при использовании косвенной речи?",
        listOf(
            Answer("а) Правильное передача смысла высказывания, контекст и обстоятельства.", true),
            Answer("б) Точное повторение оригинального высказывания без изменений.", false),
            Answer("в) Использование выражения 'по его словам' в каждом предложении.", false)
        )
    )
)

val testQuestions5 = listOf(
    Question(
        "1. Какие глаголы включает первое спряжение?",
        listOf(
            Answer("а) Оканчивающиеся на \"-ить\" и \"-еть\".", false),
            Answer("б) Оканчивающиеся на \"-ать\" и \"-ять\".", true),
            Answer("в) Оканчивающиеся на согласный звук или сочетание согласного с \"-ть\".", false)
        )
    ),
    Question(
        "2. Какие глаголы включает второе спряжение?",
        listOf(
            Answer(
                "а) Оканчивающиеся на согласный звук или сочетание согласного с \"-ть\".",
                false
            ),
            Answer("б) Оканчивающиеся на \"-ить\" и \"-еть\".", true),
            Answer("в) Оканчивающиеся на \"-ать\" и \"-ять\".", false)
        )
    ),
    Question(
        "3. Что определяют окончания глаголов в различных временах и формах?",
        listOf(
            Answer("а) Цветовые характеристики.", false),
            Answer("б) Лицо, число, время, наклонение и вид действия.", true),
            Answer("в) Способ передвижения.", false)
        )
    ),
    Question(
        "4. Какие формы спряжения глаголы имеют по лицам и числам?",
        listOf(
            Answer("а) Только по числам.", false),
            Answer("б) По лицам и числам.", true),
            Answer("в) Только по лицам.", false)
        )
    ),
    Question(
        "5. В каком времени спрягаются глаголы?",
        listOf(
            Answer("а) Только в прошедшем времени.", false),
            Answer("б) В настоящем, прошедшем и будущем временах.", true),
            Answer("в) Только в будущем времени.", false)
        )
    ),
    Question(
        "6. Что такое неправильные глаголы?",
        listOf(
            Answer("а) Глаголы, которые нельзя использовать в предложениях.", false),
            Answer(
                "б) Глаголы, имеющие особенности спряжения в различных временах и формах.",
                true
            ),
            Answer("в) Глаголы, которые не имеют форм прошедшего времени.", false)
        )
    ),
    Question(
        "7. Какие формы имеет глагол \"быть\"?",
        listOf(
            Answer("а) Буду, будешь, будет и так далее.", true),
            Answer("б) Пою, поешь, поет.", false),
            Answer("в) Бежишь, бежим, бежите.", false)
        )
    ),
    Question(
        "8. Что важно для построения грамматически правильных предложений?",
        listOf(
            Answer("а) Использование сложных слов.", false),
            Answer("б) Правильное спряжение глаголов.", true),
            Answer("в) Чтение книг.", false)
        )
    ),
    Question(
        "9. Что означает спряжение глаголов по наклонениям?",
        listOf(
            Answer("а) Их изменение по формам лица и числа.", true),
            Answer("б) Изменение по временам.", false),
            Answer("в) Изменение по родам.", false)
        )
    ),
    Question(
        "10. Какие глаголы требуют запоминания форм спряжения?",
        listOf(
            Answer("а) Только правильные глаголы.", false),
            Answer("б) Только неправильные глаголы.", false),
            Answer("в) И правильные, и неправильные глаголы.", true)
        )
    )
)

val testQuestions6 = listOf(
    Question(
        "1. Какие лица заменяют личные местоимения?",
        listOf(
            Answer("а) Первое и второе.", true),
            Answer("б) Только первое.", false),
            Answer("в) Только второе.", false)
        )
    ),
    Question(
        "2. Что указывают притяжательные местоимения?",
        listOf(
            Answer("а) Пространственное расположение.", false),
            Answer("б) Принадлежность предмета или лица.", true),
            Answer("в) Степень определенности.", false)
        )
    ),
    Question(
        "3. Какие местоимения указывают на предмет или лицо в пространстве или тексте?",
        listOf(
            Answer("а) Личные местоимения.", false),
            Answer("б) Указательные местоимения.", true),
            Answer("в) Притяжательные местоимения.", false)
        )
    ),
    Question(
        "4. Какие местоимения используются для задания вопросов или связывания предложений?",
        listOf(
            Answer("а) Притяжательные местоимения.", false),
            Answer("б) Указательные местоимения.", false),
            Answer("в) Вопросительные и относительные местоимения.", true)
        )
    ),
    Question(
        "5. Что указывают возвратные местоимения?",
        listOf(
            Answer("а) Принадлежность.", false),
            Answer("б) Пространственное расположение.", false),
            Answer("в) На то, что действие воздействует на субъекта самого действия.", true)
        )
    ),
    Question(
        "6. Какие местоимения используются для выражения отрицания?",
        listOf(
            Answer("а) Личные местоимения.", false),
            Answer("б) Притяжательные местоимения.", false),
            Answer("в) Отрицательные местоимения.", true)
        )
    ),
    Question(
        "7. Какие местоимения устанавливают определенность или неопределенность предмета или лица?",
        listOf(
            Answer("а) Притяжательные местоимения.", false),
            Answer("б) Указательные местоимения.", false),
            Answer("в) Определительные местоимения.", true)
        )
    ),
    Question(
        "8. Какие местоимения указывают на принадлежность предмета или лица?",
        listOf(
            Answer("а) Указательные местоимения.", false),
            Answer("б) Притяжательные местоимения.", true),
            Answer("в) Возвратные местоимения.", false)
        )
    ),
    Question(
        "9. Какое местоимение обозначает действие, воздействующее на субъекта самого действия?",
        listOf(
            Answer("а) Притяжательные местоимения.", false),
            Answer("б) Отрицательные местоимения.", false),
            Answer("в) Возвратные местоимения.", true)
        )
    ),
    Question(
        "10. Какие местоимения заменяют существительные и обозначают лицо (лица), говорящего и адресата?",
        listOf(
            Answer("а) Притяжательные местоимения.", false),
            Answer("б) Личные местоимения.", true),
            Answer("в) Указательные местоимения.", false)
        )
    )
)

val testQuestions7 = listOf(
    Question(
        "1. Что обозначает именительный падеж?",
        listOf(
            Answer("а) Принадлежность.", false),
            Answer("б) Место.", false),
            Answer("в) Подлежащее или именное сказуемое.", true)
        )
    ),
    Question(
        "2. Какую функцию выполняет родительный падеж?",
        listOf(
            Answer("а) Обозначает адресата.", false),
            Answer("б) Указывает на средство совершения действия.", false),
            Answer("в) Обозначает принадлежность, происхождение или содержание.", true)
        )
    ),
    Question(
        "3. Что указывает дательный падеж?",
        listOf(
            Answer("а) Место.", false),
            Answer("б) Прямое дополнение.", false),
            Answer("в) Адресата, получателя или тому, к кому направлено действие.", true)
        )
    ),
    Question(
        "4. Какой падеж обозначает прямое дополнение?",
        listOf(
            Answer("а) Именительный.", false),
            Answer("б) Винительный.", true),
            Answer("в) Творительный.", false)
        )
    ),
    Question(
        "5. Какую информацию предоставляет творительный падеж?",
        listOf(
            Answer("а) Место.", false),
            Answer("б) Принадлежность.", false),
            Answer("в) Средство, инструмент или способ совершения действия.", true)
        )
    ),
    Question(
        "6. Какой падеж обозначает место, направление, временную или причинно-следственную связь?",
        listOf(
            Answer("а) Предложный.", true),
            Answer("б) Родительный.", false),
            Answer("в) Дательный.", false)
        )
    ),
    Question(
        "7. Что обозначает родительный падеж?",
        listOf(
            Answer("а) Прямое дополнение.", false),
            Answer("б) Место.", false),
            Answer("в) Принадлежность, происхождение, содержание или отношение.", true)
        )
    ),
    Question(
        "8. Какой падеж указывает на средство, инструмент или способ совершения действия?",
        listOf(
            Answer("а) Предложный.", false),
            Answer("б) Творительный.", true),
            Answer("в) Винительный.", false)
        )
    ),
    Question(
        "9. Какой падеж указывает на подлежащее или именное сказуемое?",
        listOf(
            Answer("а) Родительный.", false),
            Answer("б) Именительный.", true),
            Answer("в) Творительный.", false)
        )
    ),
    Question(
        "10. Какой падеж обозначает причинно-следственную связь?",
        listOf(
            Answer("а) Винительный.", false),
            Answer("б) Предложный.", true),
            Answer("в) Именительный.", false)
        )
    )
)

val testQuestions8 = listOf(
    Question(
        "1. Как пишутся наречия, образованные от прилагательных путем добавления суффикса \"-о\" или \"-е\"?",
        listOf(
            Answer("а) С приставкой \"по-\".", false),
            Answer("б) С одной \"н\".", false),
            Answer("в) Слитно.", true)
        )
    ),
    Question(
        "2. Как пишутся наречия, образованные от причастий с помощью суффикса \"-а\"?",
        listOf(
            Answer("а) С одной \"н\".", false),
            Answer("б) С приставкой \"по-\".", false),
            Answer("в) Слитно.", true)
        )
    ),
    Question(
        "3. Наречия, образованные от инфинитива глагола, пишутся...",
        listOf(
            Answer("а) С приставкой \"по-\".", false),
            Answer("б) С одной \"н\".", false),
            Answer("в) Слитно.", true)
        )
    ),
    Question(
        "4. Как пишутся наречия с приставками, указывающими на отрицание или приведение к противоположному значению?",
        listOf(
            Answer("а) Слитно.", false),
            Answer("б) С одной \"н\".", false),
            Answer("в) Раздельно.", true)
        )
    ),
    Question(
        "5. В каких случаях наречия могут писаться раздельно?",
        listOf(
            Answer("а) В случае наличия приставки \"не-\".", false),
            Answer("б) Во всех случаях.", false),
            Answer(
                "в) В сложных синтаксических конструкциях или при выделении в предложении.",
                true
            )
        )
    ),
    Question(
        "6. Как пишется наречие, выделенное в предложении?",
        listOf(
            Answer("а) С приставкой \"по-\".", false),
            Answer("б) С одной \"н\".", false),
            Answer("в) Слитно.", true)
        )
    ),
    Question(
        "7. Как пишутся наречия, образованные от прилагательных, в которых стоящая перед суффиксом гласная \"и\" или \"е\", после которой следует \"н\"?",
        listOf(
            Answer("а) Слитно.", false),
            Answer("б) С одной \"н\".", false),
            Answer("в) С \"нн\".", true)
        )
    ),
    Question(
        "8. Как пишутся наречия в других случаях?",
        listOf(
            Answer("а) Слитно.", true),
            Answer("б) С \"нн\".", false),
            Answer("в) С одной \"н\".", false)
        )
    ),
    Question(
        "9. Как пишутся наречия, образованные от инфинитива глагола?",
        listOf(
            Answer("а) Слитно.", false),
            Answer("б) С \"нн\".", false),
            Answer("в) С одной \"н\".", true)
        )
    ),
    Question(
        "10. В каких случаях наречия пишутся с одной \"н\"?",
        listOf(
            Answer("а) В случае наличия приставки \"по-\".", false),
            Answer("б) В случае наличия приставки \"не-\".", false),
            Answer("в) В других случаях.", true)
        )
    )
)

val allTests = listOf(
    testQuestions1,
    testQuestions2,
    testQuestions3,
    testQuestions4,
    testQuestions5,
    testQuestions6,
    testQuestions7,
    testQuestions8,
)
